Comment: Download kubectx from https://github.com/ahmetb/kubectx
    # ARCHITECTURE should be set to "x86_64" for Intel, or "arm64" for Apple Silicon
Identifier: com.github.daz-recipes.download.kubectx
MinimumVersion: '2.3'

Input:
  NAME: kubectx
  ARCHITECTURE: "x86_64"
  # ARCHITECTURE should be set to "x86_64" for Intel, or "arm64" for Apple Silicon

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    github_repo: ahmetb/kubectx
    asset_regex: "kubectx_v.*._darwin_%ARCHITECTURE%.tar.gz"

- Processor: URLDownloader

- Processor: EndOfCheckPhase
