Comment: Download csvq from https://github.com/mithrandie/csvq
    # ARCHITECTURE should be set to "amd64" for Intel, or "arm64" for Apple Silicon
Identifier: com.github.daz-recipes.download.csvq
MinimumVersion: '2.3'

Input:
  NAME: csvq
  ARCHITECTURE: "amd64"
  # ARCHITECTURE should be set to "amd64" for Intel, or "arm64" for Apple Silicon

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    github_repo: mithrandie/csvq
    asset_regex: "csvq-v.*.-darwin-%ARCHITECTURE%.tar.gz"

- Processor: URLDownloader

- Processor: EndOfCheckPhase
