Comment: Download Luna Display primary App from https://astropad.com/app-downloads/luna-display/
Identifier: com.github.daz-recipes.download.LunaDisplay
MinimumVersion: '2.3'

Input:
  NAME: Luna Display
  DOWNLOAD_URL: https://downloads.astropad.com/luna/mac/latest
  
Process:
- Processor: URLDownloader
  Arguments:
    url: '%DOWNLOAD_URL%'
    filename: "Luna Display.dmg"
        
- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: "%pathname%/Luna Display.app"
    requirement: 'identifier "com.astro-hq.LunaDisplayMac" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "8356ZZ8Y5K")'
      