Comment: Create a package to deploy frodo to /usr/local/bin/frodo
Identifier: com.github.daz-recipes.pkg.frodo
ParentRecipe: com.github.daz-recipes.download.frodo
MinimumVersion: '2.3'

Input:
  NAME: frodo
  PKG_ID: com.github.rockcarver.frodo
  
Process:
- Processor: Unarchiver
  Arguments:
        archive_path: '%pathname%'
        destination_path: '%RECIPE_CACHE_DIR%/unpack'
        purge_destination: true 

- Processor: PkgRootCreator
  Arguments:
    pkgdirs: 
         root: "0755"
         root/usr: "0755"
         root/usr/local/: "0755"
         root/usr/local/bin/: "0755" 
    pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: Copier
  Arguments:
    source_path: '%RECIPE_CACHE_DIR%/unpack/%NAME%'
    destination_path: '%RECIPE_CACHE_DIR%/%NAME%/root/usr/local/bin/%NAME%'

- Processor: PkgCreator
  Arguments:
    pkg_request: 
        chown:
          - group: wheel
            mode: "0755"
            path: 'usr/local/bin/%NAME%'
            user: root
          - group: wheel
            mode: "0755"
            path: 'usr'
            user: root
        id: "%PKG_ID%"
        options: purge_ds_store
        pkgname: "%NAME%-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/%NAME%/root"
        version: "%version%"

- Processor: PathDeleter
  Arguments:
    path_list: 
      - '%RECIPE_CACHE_DIR%/%NAME%'
      - '%RECIPE_CACHE_DIR%/unpack'
