Comment: Download LogitechGHUB from https://download01.logi.com/web/ftp/pub/techsupport/gaming/lghub_installer.zip
Identifier: com.github.daz-recipes.download.LogitechGHUB
MinimumVersion: '2.3'

Input:
  NAME: LogitechGHUB
  DOWNLOAD_URL: "https://download01.logi.com/web/ftp/pub/techsupport/gaming/lghub_installer.zip"

Process:
- Processor: URLDownloader
  Arguments:
    url: '%DOWNLOAD_URL%'

- Processor: EndOfCheckPhase

- Processor: Unarchiver
  Arguments:
    archive_path: '%pathname%'
    destination_path: '%RECIPE_CACHE_DIR%/unpack'
    purge_destination: true

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%RECIPE_CACHE_DIR%/unpack/lghub_installer.app'
    requirement: 'identifier "com.logi.ghub.installer" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = QED4VVPZWA'