Comment: Download yq from hhttps://github.com/mikefarah/yq/releases
    # ARCHITECTURE should be set to "amd64" for Intel, or "arm64" for Apple Silicon
Identifier: com.github.daz-recipes.download.yq
MinimumVersion: '2.3'

Input:
  NAME: yq
  ARCHITECTURE: "amd64"
  # ARCHITECTURE should be set to "amd64" for Intel, or "arm64" for Apple Silicon

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    github_repo: mikefarah/yq
    asset_regex: "yq_darwin_%ARCHITECTURE%.tar.gz"

- Processor: URLDownloader

- Processor: EndOfCheckPhase
