Comment: Create a package to deploy Prezi Video to /Applications/
Identifier: com.github.daz-recipes.pkg.PreziVideo
ParentRecipe: com.github.daz-recipes.download.PreziVideo
MinimumVersion: '2.3'

Input:
  NAME: Prezi Video
  
Process:
- Processor: PkgCopier
  Arguments:
    source_pkg: '%RECIPE_CACHE_DIR%/unpack/Prezi_Video.pkg'
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'
