Comment: Create a package to deploy hoverfly to /usr/local/bin/
  # ARCHITECTURE should be set to "amd64" for Intel, or "arm64" for Apple Silicon
  # PKG_ARCH should be set to "Intel" for Intel, or "ARM" for Apple Silicon
Identifier: com.github.daz-recipes.pkg.hoverfly
ParentRecipe: com.github.daz-recipes.download.hoverfly
MinimumVersion: '2.3'

Input:
  NAME: hoverfly
  PKG_ID: com.github.spectolabs.hoverfly
  ARCHITECTURE: "amd64"
  # ARCHITECTURE should be set to "amd64" for Intel, or "arm64" for Apple Silicon
  PKG_ARCH: Intel
  # PKG_ARCH should be set to "Intel" for Intel, or "ARM" for Apple Silicon
  
Process:
- Processor: Unarchiver
  Arguments:
        archive_path: '%pathname%'
        destination_path: '%RECIPE_CACHE_DIR%/unpack'
        purge_destination: true 

- Processor: PkgRootCreator
  Arguments:
    pkgdirs: 
         scripts: "0755"
         root: "0755"
         root/usr: "0755"
         root/usr/local/: "0755"
         root/usr/local/bin/: "0755" 
    pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: Copier
  Arguments:
    source_path: '%RECIPE_CACHE_DIR%/unpack/hoverctl'
    destination_path: '%pkgroot%/root/usr/local/bin/hoverctl'
    overwrite: true

- Processor: Copier
  Arguments:
    source_path: '%RECIPE_CACHE_DIR%/unpack/hoverfly'
    destination_path: '%pkgroot%/root/usr/local/bin/hoverfly'
    overwrite: true

- Processor: PkgCreator
  Arguments:
    pkg_request: 
        chown:
          - group: wheel
            mode: "0755"
            path: 'usr/local/bin/hoverfly'
            user: root
          - group: wheel
            mode: "0755"
            path: 'usr/local/bin/hoverctl'
            user: root
          - group: wheel
            mode: "0755"
            path: 'usr'
            user: root
        id: "%PKG_ID%"
        options: purge_ds_store
        pkgname: "%NAME%-%version%-%PKG_ARCH%"
        pkgroot: "%RECIPE_CACHE_DIR%/%NAME%/root"
        version: "%version%"

- Processor: PathDeleter
  Arguments:
    path_list: 
      - '%pkgroot%'
      -  '%RECIPE_CACHE_DIR%/unpack'
