Comment: Download k6 from https://github.com/grafana/k6
    # ARCHITECTURE should be set to "amd64" for Intel, or "arm64" for Apple Silicon
Identifier: com.github.daz-recipes.download.k6
MinimumVersion: '2.3'

Input:
  NAME: k6
  ARCHITECTURE: "amd64"
  # ARCHITECTURE should be set to "amd64" for Intel, or "arm64" for Apple Silicon

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    github_repo: grafana/k6
    asset_regex: "k6-v.*.-macos-%ARCHITECTURE%.zip"

- Processor: URLDownloader

- Processor: EndOfCheckPhase
