Comment: Create a package to deploy k6 to /usr/local/bin/k6
    # ARCHITECTURE should be set to "amd64" for Intel, or "arm64" for Apple Silicon
    # PKG_ARCH should be set to "Intel" for Intel, or "ARM" for Apple Silicon
Identifier: com.github.daz-recipes.pkg.k6
ParentRecipe: com.github.daz-recipes.download.k6
MinimumVersion: '2.3'

Input:
  NAME: k6
  PKG_ID: com.github.grafana.k6
  ARCHITECTURE: "arm64"
  # ARCHITECTURE should be set to "amd64" for Intel, or "arm64" for Apple Silicon
  PKG_ARCH: "Intel"
  # PKG_ARCH should be set to "Intel" for Intel, or "ARM" for Apple Silicon
  
Process:
- Processor: Unarchiver
  Arguments:
        archive_path: '%pathname%'
        destination_path: '%RECIPE_CACHE_DIR%/unpack'
        purge_destination: true 

- Processor: PkgRootCreator
  Arguments:
    pkgdirs: 
         root: "0755"
         root/usr: "0755"
         root/usr/local/: "0755"
         root/usr/local/bin/: "0755" 
    pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: Copier
  Arguments:
    source_path: '%RECIPE_CACHE_DIR%/unpack/%NAME%-v%version%-macos-%ARCHITECTURE%/%NAME%'
    destination_path: '%pkgroot%/root/usr/local/bin/%NAME%'
    overwrite: true

- Processor: PkgCreator
  Arguments:
    pkg_request: 
        chown:
          - group: wheel
            mode: "0755"
            path: 'usr'
            user: root
        id: "%PKG_ID%"
        options: purge_ds_store
        pkgname: "%NAME%-%version%-%PKG_ARCH%"
        pkgroot: "%RECIPE_CACHE_DIR%/%NAME%/root"
        version: "%version%"
