Comment: Create a package to deploy AWSSessionManagerplugin
Identifier: com.github.daz-recipes.pkg.AWSSessionManagerplugin
ParentRecipe: com.github.daz-recipes.download.AWSSessionManagerplugin
MinimumVersion: '2.3'

Input:
  NAME: AWS Session Manager plugin
  
Process:
- Processor: FlatPkgUnpacker
  Arguments:
    destination_path: "%RECIPE_CACHE_DIR%/unpack"
    flat_pkg_path: '%pathname%'

- Processor: com.github.autopkg.novaksam-recipes.Processors/PackageInfoReader
  Arguments:
    packageinfo_path: "%RECIPE_CACHE_DIR%/unpack/PackageInfo"

- Processor: PkgCopier
  Arguments:
    source_pkg: '%RECIPE_CACHE_DIR%/downloads/session-manager-plugin.pkg'
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%pkginfo_version%.pkg'
