Comment: Download CopyClip2Helper from https://fiplab.com/apps/copyclip-helper
Identifier: com.github.daz-recipes.download.CopyClip2Helper
MinimumVersion: '2.3'

Input:
  NAME: "CopyClip 2 Helper"
  DOWNLOAD_URL: https://fiplab.com/helpers/CopyClip-2-Helper.zip

Process:
- Processor: URLDownloader
  Arguments:
    url: '%DOWNLOAD_URL%'
    
- Processor: EndOfCheckPhase

- Processor: Unarchiver
  Arguments:
    archive_path: '%pathname%'
    destination_path: '%RECIPE_CACHE_DIR%/unpack'
    purge_destination: true

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%destination_path%/CopyClip 2 Helper.app'
    requirement: 'anchor apple generic and identifier "com.fiplab.copyclip2helperinstaller" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = VM4H2VWS56)'
