Comment: Create a package to deploy shfmt to /usr/local/bin/shfmt, then
   # ARCHITECTURE should be set to "amd64" for Intel, or "arm64" for Apple Silicon
   # PKG_ARCH should be set to "Intel" for Intel, or "ARM" for Apple Silicon
Identifier: com.github.daz-recipes.pkg.shfmt
ParentRecipe: com.github.daz-recipes.download.shfmt
MinimumVersion: '2.3'

Input:
  NAME: shfmt
  PKG_ID: com.github.mvdan.shfmt
  ARCHITECTURE: "amd64"
  # ARCHITECTURE should be set to "amd64" for Intel, or "arm64" for Apple Silicon
  PKG_ARCH: "Intel"
  # PKG_ARCH should be set to "Intel" for Intel, or "ARM" for Apple Silicon
    
Process:
- Processor: PkgRootCreator
  Arguments:
    pkgdirs: 
         root: "0755"
         root/usr: "0755"
         root/usr/local/: "0755"
         root/usr/local/bin/: "0755" 
    pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: Copier
  Arguments:
    source_path: '%pathname%'
    destination_path: '%pkgroot%/root/usr/local/bin/%NAME%'
    overwrite: true

- Processor: PkgCreator
  Arguments:
    pkg_request: 
        chown:
          - group: wheel
            mode: "0755"
            path: 'usr'
            user: root
        id: "%PKG_ID%"
        options: purge_ds_store
        pkgname: "%NAME%-%version%-%PKG_ARCH%"
        pkgroot: "%RECIPE_CACHE_DIR%/%NAME%/root"
        version: "%version%"

- Processor: PathDeleter
  Arguments:
    path_list: 
      - '%pkgroot%'
