Comment: Download OxygenXML from https://www.oxygenxml.com/xml_editor/download_oxygenxml_editor.html
Identifier: com.github.daz-recipes.download.OxygenXML
MinimumVersion: '2.3'

Input:
  NAME: OxygenXML
  DOWNLOAD_URL: https://mirror.oxygenxml.com/InstData/Editor/MacOSX/VM/oxygen-openjdk.dmg

Process:
- Processor: URLDownloader
  Arguments:
    url: '%DOWNLOAD_URL%'
    
- Processor: EndOfCheckPhase
