Comment: Create a package to deploy fzf and fzf-tmux to /usr/local/bin/
    # ARCHITECTURE should be set to "amd64" for Intel, or "arm64" for Apple Silicon
    # PKG_ARCH should be set to "Intel" for Intel, or "ARM" for Apple Silicon
Identifier: com.github.daz-recipes.pkg.fzf
ParentRecipe: com.github.daz-recipes.download.fzf
MinimumVersion: '2.3'

Input:
  NAME: fzf
  PKG_ID: com.github.junehunn.fzf
  ARCHITECTURE: "amd64"
  # ARCHITECTURE should be set to "amd64" for intel, or "arm64" for Apple Silicon
  PKG_ARCH: "Intel"
  # PKG_ARCH should be set to "Intel" for Intel, or "ARM" for Apple Silicon
   
Process:
- Processor: FileFinder
  Arguments:
    pattern: '%RECIPE_CACHE_DIR%/downloads/fzf-*.zip'

- Processor: Unarchiver
  Arguments:
        archive_path: '%found_filename%'
        destination_path: '%RECIPE_CACHE_DIR%/unpack'
        purge_destination: true

- Processor: PkgRootCreator
  Arguments:
    pkgdirs: 
         root: "0755"
         root/usr: "0755"
         root/usr/local/: "0755"
         root/usr/local/bin/: "0755" 
    pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: Copier
  Arguments:
    source_path: '%RECIPE_CACHE_DIR%/unpack/%NAME%'
    destination_path: '%pkgroot%/root/usr/local/bin/%NAME%'
    overwrite: true

- Processor: Copier
  Arguments:
    source_path: '%RECIPE_CACHE_DIR%/downloads/fzf-tmux'
    destination_path: '%pkgroot%/root/usr/local/bin/fzf-tmux'
    overwrite: true

- Processor: PkgCreator
  Arguments:
    pkg_request: 
        chown:
          - group: wheel
            mode: "0755"
            path: 'usr'
            user: root
        id: "%PKG_ID%"
        options: purge_ds_store
        pkgname: "%NAME%-%version%-%PKG_ARCH%"
        pkgroot: "%RECIPE_CACHE_DIR%/%NAME%/root"
        version: "%version%"

- Processor: PathDeleter
  Arguments:
    path_list: 
      - '%pkgroot%'
      - '%RECIPE_CACHE_DIR%/unpack'
