Comment: Create a package to install zoc8
Identifier: com.github.daz-recipes.pkg.zoc8
ParentRecipe: com.github.daz-recipes.download.zoc8
MinimumVersion: '2.3'

Input:
  NAME: zoc8
  
Process:
- Processor: AppPkgCreator

