Comment: Create a package to install GnuPG
Identifier: com.github.daz-recipes.pkg.GnuPG
ParentRecipe: com.github.daz-recipes.download.GnuPG
MinimumVersion: '2.3'

Input:
  NAME: GnuPG
  
Process:
- Processor: FileFinder
  Arguments:
    pattern: "%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/*.pkg"

- Processor: com.github.homebysix.VersionSplitter/VersionSplitter
  Arguments:
    split_on: "GnuPG-"
    version: '%url%'
    index: 1

- Processor: com.github.homebysix.VersionSplitter/VersionSplitter
  Arguments:
    split_on: ".dmg"
    version: '%version%'
    index: 0
    
- Processor: PkgCopier
  Arguments:
    source_pkg: '%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/%dmg_found_filename%'
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'