Comment: Rename the Delinea Connection Manager package with the correct version
Identifier: com.github.daz-recipes.pkg.DelineaConnectionManager
ParentRecipe: com.github.daz-recipes.download.DelineaConnectionManager
MinimumVersion: '2.3'

Input:
  NAME: Delinea Connection Manager
  VERSION_TYPE: CFBundleShortVersionString
  
Process:
- Processor: FlatPkgUnpacker
  Arguments:
    destination_path: "%RECIPE_CACHE_DIR%/unpack"
    flat_pkg_path: '%pathname%'

- Processor: PkgPayloadUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/payload'
    pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/Delinea.ConnectionManager.pkg/Payload'

- Processor: Versioner
  Arguments:
    input_plist_path: '%RECIPE_CACHE_DIR%/payload/%NAME%.app/Contents/Info.plist'
    plist_version_key: '%VERSION_TYPE%'

- Processor: PkgCopier
  Arguments:
    source_pkg: '%pathname%'
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'

- Processor: PathDeleter
  Arguments:
    path_list:
        - '%RECIPE_CACHE_DIR%/unpack'
        - '%RECIPE_CACHE_DIR%/payload'
