Comment: Download ipcalc from https://github.com/kjokjo/ipcalc
Identifier: com.github.daz-recipes.download.ipcalc
MinimumVersion: '2.3'

Input:
  NAME: ipcalc

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: '/releases/tag/v?([\d.]+)'
    result_output_var_name: version
    url: "https://github.com/kjokjo/ipcalc/releases/latest"
    filename: "%NAME%.zip"

- Processor: URLDownloader
  Arguments:
    url: "https://github.com/kjokjo/ipcalc/archive/refs/tags/%version%.zip"

- Processor: EndOfCheckPhase
