Comment: Download Archi from https://www.archimatetool.com/download/
  # SEARCH_TERMS should be set to:
  # - "downloads/archi5\\.php\\?/[0-9]+.[0-9]+.[0-9]+/Archi-Mac-[0-9]+.[0-9]+.[0-9]+.dmg" for intel, 
  # - or "downloads/archi5\\.php\\?/[0-9]+.[0-9]+.[0-9]+/Archi-Mac-Silicon-[0-9]+.[0-9]+.[0-9]+.dmg" for Apple Silicon
Identifier: com.github.daz-recipes.download.archi
MinimumVersion: '2.3'

Input:
  NAME: Archi
  CHECK_URL: https://www.archimatetool.com/download/
  DOWNLOAD_URL: "https://www.archimatetool.com"
  SEARCH_TERMS: "downloads/archi5\\.php\\?/[0-9]+.[0-9]+.[0-9]+/Archi-Mac-Silicon-[0-9]+.[0-9]+.[0-9]+.dmg"
  # SEARCH_TERMS should be set to:
  # - "downloads/archi5\\.php\\?/[0-9]+.[0-9]+.[0-9]+/Archi-Mac-[0-9]+.[0-9]+.[0-9]+.dmg" for intel, 
  # - or "downloads/archi5\\.php\\?/[0-9]+.[0-9]+.[0-9]+/Archi-Mac-Silicon-[0-9]+.[0-9]+.[0-9]+.dmg" for Apple Silicon


Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: '%SEARCH_TERMS%'
    url: '%CHECK_URL%'

- Processor: URLDownloader
  Arguments:
    url: '%DOWNLOAD_URL%/%match%'
    
- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: "%pathname%/Archi.app"
    requirement: 'identifier "com.archimatetool.editor" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "375WT5T296"'
