Comment: Download kustomize from https://github.com/kubernetes-sigs/kustomize
    # ARCHITECTURE should be set to "amd64" for Intel, or "arm64" for Apple Silicon
    # PKG_ARCH should be set to "Intel" for Intel and "ARM" for ARM  
Identifier: com.github.daz-recipes.pkg.k9s
ParentRecipe: com.github.daz-recipes.download.k9s
MinimumVersion: '2.3'

Input:
  NAME: k9s
  PKG_ID: com.github.Derailed.k9s
  ARCHITECTURE: "amd64"
  # ARCHITECTURE should be set to "amd64" for Intel, or "arm64" for Apple Silicon
  PKG_ARCH: Intel
  # PKG_ARCH should be set to "Intel" for Intel and "ARM" for ARM    
  
Process:
- Processor: Unarchiver
  Arguments:
        archive_path: '%pathname%'
        destination_path: '%RECIPE_CACHE_DIR%/unpack'
        purge_destination: true 

- Processor: PkgRootCreator
  Arguments:
    pkgdirs: 
         root: "0755"
         root/usr: "0755"
         root/usr/local/: "0755"
         root/usr/local/bin/: "0755" 
    pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: Copier
  Arguments:
    source_path: '%RECIPE_CACHE_DIR%/unpack/%NAME%'
    destination_path: '%pkgroot%/root/usr/local/bin/%NAME%'
    overwrite: true

- Processor: PkgCreator
  Arguments:
    pkg_request: 
        chown:
          - group: wheel
            mode: "0755"
            path: 'usr'
            user: root
        id: "%PKG_ID%"
        options: purge_ds_store
        pkgname: "%NAME%-%version%-%PKG_ARCH%"
        pkgroot: "%RECIPE_CACHE_DIR%/%NAME%/root"
        version: "%version%"