Comment: Download spectral from https://github.com/stoplightio/spectral
Identifier: com.github.daz-recipes.download.spectral
MinimumVersion: '2.3'

Input:
  NAME: spectral

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    github_repo: stoplightio/spectral
    asset_regex: "spectral-macos"

- Processor: URLDownloader

- Processor: StopProcessingIf
  Arguments:
    predicate: 'download_changed == FALSE'

- Processor: EndOfCheckPhase
