Comment: Package spectral from https://github.com/stoplightio/spectral
Identifier: com.github.daz-recipes.pkg.spectral
ParentRecipe: com.github.daz-recipes.download.spectral
MinimumVersion: '2.3'

Input:
  NAME: spectral
  PKG_ID: com.github.stoplightio.spectral
  
Process:
- Processor: PkgRootCreator
  Arguments:
    pkgdirs: 
         root: "0755"
         root/usr: "0755"
         root/usr/local/: "0755"
         root/usr/local/bin/: "0755" 
    pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: Copier
  Arguments:
    source_path: '%pathname%'
    destination_path: '%pkgroot%/root/usr/local/bin/%NAME%'
    overwrite: true

- Processor: PkgCreator
  Arguments:
    pkg_request: 
        chown:
          - group: wheel
            mode: "0755"
            path: 'usr'
            user: root
        id: "%PKG_ID%"
        options: purge_ds_store
        pkgname: "%NAME%-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/%NAME%/root"
        version: "%version%"

- Processor: PathDeleter
  Arguments:
    path_list: 
      - '%pkgroot%'