Comment: Download operator-sdk from https://github.com/operator-framework/operator-sdk
    # ARCHITECTURE should be set to "amd64" for Intel, or "arm64" for Apple Silicon
Identifier: com.github.daz-recipes.download.operator-sdk
MinimumVersion: '2.3'

Input:
  NAME: operator-sdk
  ARCHITECTURE: "amd64"
  # ARCHITECTURE should be set to "amd64" for Intel, or "arm64" for Apple Silicon

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    github_repo: operator-framework/operator-sdk
    asset_regex: 'operator-sdk_darwin_%ARCHITECTURE%'

- Processor: URLDownloader

- Processor: EndOfCheckPhase
